In [6]:
import pandas as pd

data = {
    'Hari': ['Senin', 'Selasa', 'Rabu', 'Kamis', 'Jumat', 'Sabtu', 'Minggu'],
    'Datang': [2, 3, 4, 1, 2, 5, 2],
    'Biaya': [30000, 35000, 25000, 15000, 20000, 30000, 35000],
    'Mahasiswa': ['Ani', 'Budi', 'Jono', 'Lono', 'Joni', 'Ani', 'Budi'],
}

df = pd.DataFrame(data)
df

     Hari  Datang  Biaya Mahasiswa
0   Senin       2  30000       Ani
1  Selasa       3  35000      Budi
2    Rabu       4  25000      Jono
3   Kamis       1  15000      Lono
4   Jumat       2  20000      Joni
5   Sabtu       5  30000       Ani
6  Minggu       2  35000      Budi

In [3]:
df['Total Biaya'] = df['Biaya'] * df['Datang']
df

     Hari  Datang  Biaya Mahasiswa  Total Biaya
0   Senin       2  30000       Ani        60000
1  Selasa       3  35000      Budi       105000
2    Rabu       4  25000      Jono       100000
3   Kamis       1  15000      Lono        15000
4   Jumat       2  20000      Joni        40000
5   Sabtu       5  30000       Ani       150000
6  Minggu       2  35000      Budi        70000

In [5]:
average_datang = df['Datang'].mean()
average_datang

2.7142857142857144

In [9]:
df['Total Biaya']=df['Biaya']*df['Datang']
highest_cost_day = df.loc[df['Total Biaya'].idxmax()]
print(highest_cost_day)

Hari            Sabtu
Datang              5
Biaya           30000
Mahasiswa         Ani
Total Biaya    150000
Name: 5, dtype: object

In [20]:
df['Total Biaya'] = df['Biaya']*df['Datang']
days_above_threshold = df[df['Total Biaya'] > 110000]['Hari']
print(days_above_threshold)

5    Sabtu
Name: Hari, dtype: object

In [14]:
most_frequent_visitor = df['Mahasiswa'].value_counts().idxmax()
most_frequent_visitor

'Ani'

In [15]:
visitor_on_sunday = df[df['Hari'] == 'Minggu']['Mahasiswa'].values[0]
print(visitor_on_sunday)

Budi

In [17]:
df['Total Biaya']=df['Biaya']*df['Datang']
biaya_tertinggi = df['Total Biaya'].max()
biaya_terendah = df['Total Biaya'].min()

print("Biaya tertinggi:", biaya_tertinggi)
print("Biaya terendah:", biaya_terendah)

Biaya tertinggi: 150000
Biaya terendah: 15000

In [13]:
datang_tertinggi = df['Datang'].max()
datang_terendah = df['Datang'].min()

print("Frekuensi tertinggi:", datang_tertinggi)
print("Frekuensi terendah:", datang_terendah)

NameError: name 'df' is not defined